
// import React from 'react';
import TextWithLineBreaks from '@/components/FunctionComponent/TextWithLineBreaks'

const rawText = `地铁上一个中年男人突然站到我面前
面部肤色偏黑，类似印地安人似的黑，

眉眼略显刚毅与睿智，

眼睛偏细长，

透漏出的眼神很有冲击力，

面部整洁略有光泽，
脸型很像我知道的一个道士

地铁上，这样一张脸，伴随着一个快速站在我面前的人突然出现。我抬起头视角上扬一点儿就可以与他四目相对。

我和他对视了一小会儿，然后利用余光观察他的脸，在一瞬间观察到了上述特征。我也不知道我哪儿来的这么大戒备心理，可能是因为快速且特别正好站在我面前，我当时坐着低头看手机。但是他能干啥呢，和谐社会，当时真的是奥！哈哈哈哈，我自己杠上了🤣。不过人家一直眼神坚定的在看我头上的玻璃，应该是有地铁地图了。而且人家从来没正眼看我🤣🤣🤣。

我期间甚至想过他想让我给他让座，然后我还寻思说话客气点儿也不是不可以，但是上班这么苦，大家都差不多，让座这个事儿就算了吧。

以及，我因为觉得他的眼神凌厉，配合他带着智慧的眉毛，我甚至觉得他会算命….所以他是不能轻易招惹的那种…

尽管觉得了这么些，我依然在盯着他的眼睛看了10数秒后强装镇定地把目光移向了自己的手机…🤣🤣🥲，甚至表情略带严肃🤣🤣🤣。`;

const Chapter12 = () => {
  return <TextWithLineBreaks rawText={rawText} />
};

export default Chapter12;
