
// import React from 'react';
import TextWithLineBreaks from '@/components/FunctionComponent/TextWithLineBreaks'

const rawText = `关于动手打了猫咪
其实之后我是后悔了的。然后还和猫咪道了歉。

起因是我看到小花（公猫）在咬小黑（母猫）的脖子，然后我就下意识抬起手就打了小花。当下的那一刻，“男性怎么可以这么对女性”的想法瞬间占领了所有高地，没有任何犹豫的选择制裁小花。在小花跑开后，越想我越气，在整个屋子里抓捕小花，战场从床底，到柜子上面，再到沙发后面，抓到后，在小黑面前用手指打小花的嘴，同时言语教训它。但是应该是打到了鼻子，小花擤鼻涕的时候出来一个带血丝的鼻屎，顿时我后悔了，放了句狠话就松开手了。

“我打狠了吗？”

“我是不是可以有更好的教育，或者说是沟通方式啊？！”

“诶呦，这样打坏了鼻子的话小花还能正常吃饭吗？” 然后拆开一个牛肉干，找到躲起来的小花，放到地上。偷偷观察了好久，吃了，“哦！好在能吃东西，那就没啥大事儿！！！因为这个变得不能吃饭那可真的太罪过了！！！”

过了一会儿，看到小花自己挤在墙角，闭目养神，我就会觉得它的眼神不憨了，也不舒展了，变得委屈了。我顿时又后悔打小花了。虽然我清楚动物有的时候确实需要一些物理手段，而且这不是我第一次看见小花这样对待小黑，但是我依然觉得我下手狠了，就想着怎么弥补它一下。

我蹲下来，看着小花，想抱它又怕它害怕，然后就一直觉得有歉意，再一想想之前小花还是很粘我的，回家进门之后会等我、 冲我叫，会时不时地用头蹭我的脚、手、或者小腿，睡着之后也会在我身边来回蹭，“诶呦，我真的是”，心里一阵酸楚，“我真的不该打你，对不起奥！” 这句话说出来我眼睛就湿润了。我当时自己内心确实还是很震惊的，震惊我为什么会哭。但是我又觉得自己确实做错了，然后还会代入那种渣男和女朋友吵架后通过在女朋友面前哭来企图挽回女朋友的戏码。。。 不过这个想法闪了几秒就没了。

但是看到我哭后，小花坐起来了，一开始有些难为情的状态，低着头，但是时不时地抬起眼仁，且眼睛不动的观察我。然后想尽办法通过语言表达我的歉意，人的情感和说出来的话以及脑子里的想法应该是有某种联系的，然后我的情感愈发汹涌，甚至不能自已，在这个过程中小花逐渐变得大大方方地观察我，然后我能感觉到它的眼睛里没有委屈了，然后我凑上前去，轻轻地摸摸他的头，它也闭眼享受，伴随着呼呼声，然后我又拿来一份牛肉干，但是这份到现在也没吃。

言而总之，我之后不想再打小花了，这事儿，就是杜绝。然后用其他方式与它交流，然后也希望它能理解吧。 同时让自己可以多些耐心，然后不要觉得男娃粗糙一点儿对待也是可以的，都是需要关注的。应该也是因为我的这个想法，导致现在小黑对我有恃无恐，小花只有在我心情舒畅或者安静的时候才敢来找我亲近。之后会温柔些，一致对待奥！

然后关于小花咬小黑，现在回想了一下，小黑双眼呆呆的，应该不是互相伤害来的，嗨。男女平等，男女平等奥，猫咪也是，猫咪也是～～～`;

const Chapter4 = () => {
  return <TextWithLineBreaks rawText={rawText} />
};

export default Chapter4;
